app/controllers/cookies_controller.rb

SELECT "ovens".* FROM "ovens" WHERE "ovens"."user_id" = ? AND "ovens"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def new
    @oven = current_user.ovens.find_by!(id: params[:oven_id])

SELECT "ovens".* FROM "ovens" WHERE "ovens"."user_id" = ? AND "ovens"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "cookies" ("fillings", "storage_type", "storage_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["fillings", "beef"], ["storage_type", "Oven"], ["storage_id", 1], ["created_at", "2023-08-06 16:06:30.908685"], ["updated_at", "2023-08-06 16:06:30.908685"], ["status", 0]]
---
  def create
    @oven = current_user.ovens.find_by!(id: params[:oven_id])
    @cookie = @oven.create_cookie!(cookie_params)

SELECT "cookies".* FROM "cookies" WHERE "cookies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cookies" WHERE "cookies"."id" = ?  [["id", 2]]
---
  def destroy
    @cookie = Cookie.find(params[:oven_id])
    @cookie.destroy