app/jobs/cookie_cook_job.rb

SELECT "cookies".* FROM "cookies" WHERE "cookies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cookies" SET "updated_at" = ?, "status" = ? WHERE "cookies"."id" = ?  [["updated_at", "2023-08-06 16:07:31.054143"], ["status", 1], ["id", 1]]
---
  def perform(cookie_id)
    cookie = Cookie.find_by(id: cookie_id)
    return unless cookie

    sleep 30.seconds

    cookie.update(status: true)